// 24. Вывести на экран таблицу квадратов чисел от 1 до N

int N=Convert.ToInt32(Console.ReadLine());
for (int i=1;i<=N;i++)
    System.Console.Write($"{i*i} ");
